
#Напишите программу, которая будет печатать лесенку

number = int(input("Введите число: "))

for i in range(1, number + 1):
    print(i * '*')
