#Дано n-значное целое число N. Определите, входят ли в него цифры 3 и 7.

number = input("Введите число: ")

if '3' in number:
    print("Цифра 3 входит в число N")
else:
    print("Цифра 3 не входит в число N")

if '7' in number:
    print("Цифра 7 входит в число N")
else:
    print("Цифра 7 не входит в число N")
